Collecting openpyxl
  Using cached openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Using cached et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Using cached openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Using cached et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [105]:
import pandas as pd

In [120]:
data = pd.read_excel("morocco_ecommerce.xlsx")
data.head()

,order_id,customer_id,order_date,ship_date,region,city,payment_method,product_category,product_id,quantity,unit_price,total_amount,discount_code,order_status
0,ORD000001,CUS00179,2023-03-14,2023-03-17,Casablanca-Settat,Casablanca,Credit Card,electronics,P00778,3,free,1315.19,SALE20,Returned
1,ORD000002,CUS01548,2023-01-13,2023-01-15,Béni Mellal-Khénifra,Khénifra,Bank Transfer,Home & Kitchen,P00081,3,417.67,1253.01,FREESHIP,Shipped
2,ORD000003,CUS01309,2023-08-17,2023-08-22,Béni Mellal-Khénifra,Béni Mellal,Bank Transfer,Home & Kitchen,P00215,2,384.54,769.08,WELCOME,Returned
3,ORD000004,CUS00878,2023-09-06,2023-09-13,Oriental,Berkane,Bank Transfer,Sports,P00565,4,206.38,825.52,NaN,Returned
4,ORD000005,CUS00866,2023-10-09,NaN,Béni Mellal-Khénifra,Khénifra,Credit Card,Fashion,P00923,1,426.41,426.41,NaN,Processing

In [107]:
data.loc[0:5, ["order_id", "region", "city"]]

    order_id                region         city
0  ORD000001     Casablanca-Settat   Casablanca
1  ORD000002  Béni Mellal-Khénifra     Khénifra
2  ORD000003  Béni Mellal-Khénifra  Béni Mellal
3  ORD000004              Oriental      Berkane
4  ORD000005  Béni Mellal-Khénifra     Khénifra
5  ORD000006        Marrakech-Safi    Marrakech

In [19]:
data.iloc[0:5, [0, 3, 4]]

    order_id   ship_date                region
0  ORD000001  2023-03-17     Casablanca-Settat
1  ORD000002  2023-01-15  Béni Mellal-Khénifra
2  ORD000003  2023-08-22  Béni Mellal-Khénifra
3  ORD000004  2023-09-13              Oriental
4  ORD000005  2023-10-11  Béni Mellal-Khénifra

In [22]:
data.shape

(5000, 14)

In [108]:
data.loc[:,data.columns[:3]]

       order_id customer_id  order_date
0     ORD000001    CUS00179  2023-03-14
1     ORD000002    CUS01548  2023-01-13
2     ORD000003    CUS01309  2023-08-17
3     ORD000004    CUS00878  2023-09-06
4     ORD000005    CUS00866  2023-10-09
...         ...         ...         ...
4995  ORD004996    CUS00424  2023-06-21
4996  ORD004997    CUS01493  2023-12-29
4997  ORD004998    CUS01639  2023-05-09
4998  ORD004999    CUS01357  2023-07-25
4999  ORD005000    CUS00997  2023-08-12

[5000 rows x 3 columns]

In [25]:
def load_data(file_path):
    if file_path.endswith('.xlsx'):
        return pd.read_excel(file_path)
    elif file_path.endswith('.json'):
        return pd.read_json(file_path)
    elif file_path.endswith('.csv'):
        return pd.read_csv(file_path, sep="|")
    else:
        raise ValueError("Unsupported file format")

In [29]:
def columns_type(df):
    return df.dtypes

In [49]:
columns_type(data)

order_id             object
customer_id          object
order_date           object
ship_date            object
region               object
city                 object
payment_method       object
product_category     object
product_id           object
quantity              int64
unit_price          float64
total_amount        float64
discount_code        object
order_status         object
dtype: object

In [47]:
#5.Count how many missing values there are in each column.
def count_missing_values(df):
    return df.isnull().sum()

In [124]:
count_missing_values(data)

order_id               0
customer_id            0
order_date             0
ship_date            378
region               256
city                 241
payment_method       257
product_category       0
product_id             0
quantity              32
unit_price            35
total_amount           0
discount_code       1045
order_status           0
dtype: int64

In [125]:
#6.Which column or columns contain the highest number of missing values?
def column_with_most_missing_values(df):
    missing_counts = df.isnull().sum()
    max_missing = missing_counts.max()
    return missing_counts[missing_counts == max_missing].index.tolist()

In [126]:
column_with_most_missing_values(data)

['discount_code']

In [147]:
#7.Remove all rows that contain any missing values and report how many rows remain.
def remove_rows_with_missing_values(df):
    cleaned_df = df.dropna()
    return cleaned_df.reset_index(drop=True)

Before removing missing values: 5000 rows
After removing missing values: (       order_id customer_id  order_date   ship_date  \
0     ORD000001    CUS00179  2023-03-14  2023-03-17
1     ORD000002    CUS01548  2023-01-13  2023-01-15
2     ORD000003    CUS01309  2023-08-17  2023-08-22
6     ORD000007    CUS00172  2023-07-01  2023-07-08
7     ORD000008    CUS01395  2023-10-29  2023-10-30
...         ...         ...         ...         ...
4988  ORD004989    CUS01863  29/08/2023  2023-08-29
4991  ORD001489    CUS00223  2023-02-18  2023-02-21
4994  ORD004995    CUS01285  2023-12-16  2023-12-12
4997  ORD004998    CUS01639  2023-05-09  2023-05-08
4999  ORD005000    CUS00997  2023-08-12  2023-08-12

                         region         city    payment_method  \
0             Casablanca-Settat   Casablanca       Credit Card
1          Béni Mellal-Khénifra     Khénifra     Bank Transfer
2          Béni Mellal-Khénifra  Béni Mellal     Bank Transfer
6     Tanger-Tétouan-Al Hoceïma      Tétouan       Credit Card
7                   Souss-Massa       Agadir  Cash on Delivery
...                         ...          ...               ...
4988  Tanger-Tétouan-Al Hoceïma       Tanger    Mobile Payment
4991          Casablanca-Settat       Settat  Cash on Delivery
4994                   Oriental        Nador  Cash on Delivery
4997  Tanger-Tétouan-Al Hoceïma   Al Hoceïma     Bank Transfer
4999                Souss-Massa     Tiznit         Credit Card

     product_category product_id quantity unit_price  total_amount  \
0         electronics     P00778        3       free       1315.19
1      Home & Kitchen     P00081        3     417.67       1253.01
2      Home & Kitchen     P00215        2     384.54        769.08
6      Home & Kitchen     P00935        4     299.21       1196.84
7              Sports     P00987        1     473.38        473.38
...               ...        ...      ...        ...           ...
4988      Electronics     P00116        4      402.5       1610.00
4991   Home & Kitchen     P00818        5     349.17       1745.85
4994   Home & Kitchen     P00040        2     128.84        257.68
4997           Sports     P00298        4     548.73       2194.92
4999            Books     P00301        1     441.38        441.38

     discount_code order_status
0           SALE20     Returned
1         FREESHIP      Shipped
2          WELCOME     Returned
6            AYD10   Processing
7        RAMADAN10   Processing
...            ...          ...
4988         AYD10      Shipped
4991       WELCOME   Processing
4994       WELCOME    Cancelled
4997      FREESHIP     Returned
4999     RAMADAN10    Delivered

[3125 rows x 14 columns], 3125)

In [131]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          5000 non-null   object
 1   customer_id       5000 non-null   object
 2   order_date        5000 non-null   object
 3   ship_date         4622 non-null   object
 4   region            4744 non-null   object
 5   city              4759 non-null   object
 6   payment_method    4743 non-null   object
 7   product_category  5000 non-null   object
 8   product_id        5000 non-null   object
 9   quantity          4968 non-null   object
 10  unit_price        4965 non-null   object
 11  total_amount      5000 non-null   float64
 12  discount_code     3955 non-null   object
 13  order_status      5000 non-null   object
dtypes: float64(1), object(13)
memory usage: 547.0+ KB

In [53]:
#8.Fill missing values in the city column with the string "Unknown".
def count_missing_city_with_unknown(df):
    df['city'] = df['city'].fillna("Unknown")

    return df.loc[:, ['city']].isnull().sum()

In [ ]:
#8.Fill missing values in the city column with the string "Unknown".
def fill_missing_city_with_unknown(df):
    df['city'] = df['city'].fillna("Unknown")
    return df

In [54]:
count_missing_city_with_unknown(data)

city    0
dtype: int64

In [69]:
#9.Fill missing values in the unit_price column using the mean of that column.
def fill_missing_unit_price_with_mean(df):
    mean_price = df['unit_price'].mean()
    df['unit_price'] = df['unit_price'].fillna(mean_price)
    return df

In [143]:
data = load_data("morocco_ecommerce.xlsx")
len(data[data['unit_price'] == 'free'])

45

In [61]:
#10.Determine how many fully duplicated rows exist in the dataset.

def count_fully_duplicated_rows(df):
    return df.duplicated().sum()

In [62]:
count_fully_duplicated_rows(data)

np.int64(0)

In [63]:
#11.Remove duplicated rows and report the new number of rows.
def remove_duplicated_rows(df):
    cleaned_df = df.drop_duplicates()
    return cleaned_df, cleaned_df.shape[0]

In [101]:
#12.Remove duplicates based only on the order_id column, keeping the first occurrence.
def remove_duplicates_based_on_order_id(df):
    cleaned_df = df.drop_duplicates(subset=['order_id'], keep='first')
    return cleaned_df, cleaned_df.shape[0]

In [148]:
data=remove_duplicates_based_on_order_id(data)

AttributeError: 'tuple' object has no attribute 'drop_duplicates'

In [ ]:
#global function data preparation takes only file path as input and executes all the above functions in sequence
def data_preparation(file_path):
    df = load_data(file_path)
    print("First 5 rows of the dataset:")
 
    print("\nColumn data types:")
    print(columns_type(df))
    print("\nMissing values in each column:")
    print(count_missing_values(df))
    print("\nColumn(s) with the most missing values:")
    print(column_with_most_missing_values(df))
    df_no_missing, rows_remaining = remove_rows_with_missing_values(df)
    print(f"\nNumber of rows after removing rows with missing values: {rows_remaining}")
    #fill the price free with 0 of unit_price
    df['unit_price'] = df['unit_price'].replace('free', 0)
    #check the unit_price values are not free anymore
    print("\nUnit price values after replacing 'free' with 0:")
    print(len(df[df['unit_price'] == 'free']))
    df_filled_city = fill_missing_city_with_unknown(df)

    duplicated_count = count_fully_duplicated_rows(df_filled_city)
    print(f"\nNumber of fully duplicated rows: {duplicated_count}")
    df_no_duplicates, new_row_count = remove_duplicated_rows(df_filled_city)
    print(f"\nNumber of rows after removing duplicated rows: {new_row_count}")
    df_final, final_row_count = remove_duplicates_based_on_order_id(df_no_duplicates)
    print(f"\nNumber of rows after removing duplicates based on order_id: {final_row_count}")
    return df_final

In [73]:
columns_type(data)

order_id             object
customer_id          object
order_date           object
ship_date            object
region               object
city                 object
payment_method       object
product_category     object
product_id           object
quantity              int64
unit_price          float64
total_amount        float64
discount_code        object
order_status         object
dtype: object

In [ ]:
#19.sum of total_amount per product_id
data.groupby('product_id')['total_amount'].sum().max()

product_id
P00001     6520.16
P00002     6899.94
P00003     2511.07
P00004    12454.12
P00005     5463.19
            ...
P00995    11115.54
P00996    70221.69
P00997     4859.48
P00998     1842.71
P00999     7726.20
Name: total_amount, Length: 989, dtype: float64

In [145]:
#fill the price free with 0 of unit_price
data['unit_price'] = data['unit_price'].replace('free', 0)

TypeError: tuple indices must be integers or slices, not str

In [146]:
len(data[data['unit_price'] == 'free'])

TypeError: tuple indices must be integers or slices, not str

In [141]:
data=remove_rows_with_missing_values(data)

AttributeError: 'tuple' object has no attribute 'dropna'

In [139]:
count_missing_values(data)

order_id               0
customer_id            0
order_date             0
ship_date            378
region               256
city                 241
payment_method       257
product_category       0
product_id             0
quantity              32
unit_price            35
total_amount           0
discount_code       1045
order_status           0
dtype: int64

In [98]:
#executing the global function
data_preparation("morocco_ecommerce.xlsx")

First 5 rows of the dataset:
    order_id customer_id  order_date   ship_date                region  \
0  ORD000001    CUS00179  2023-03-14  2023-03-17     Casablanca-Settat
1  ORD000002    CUS01548  2023-01-13  2023-01-15  Béni Mellal-Khénifra
2  ORD000003    CUS01309  2023-08-17  2023-08-22  Béni Mellal-Khénifra
3  ORD000004    CUS00878  2023-09-06  2023-09-13              Oriental
4  ORD000005    CUS00866  2023-10-09         NaN  Béni Mellal-Khénifra

          city payment_method product_category product_id quantity unit_price  \
0   Casablanca    Credit Card      electronics     P00778        3       free
1     Khénifra  Bank Transfer   Home & Kitchen     P00081        3     417.67
2  Béni Mellal  Bank Transfer   Home & Kitchen     P00215        2     384.54
3      Berkane  Bank Transfer           Sports     P00565        4     206.38
4     Khénifra    Credit Card          Fashion     P00923        1     426.41

   total_amount discount_code order_status
0       1315.19        SALE20     Returned
1       1253.01      FREESHIP      Shipped
2        769.08       WELCOME     Returned
3        825.52           NaN     Returned
4        426.41           NaN   Processing

Column names:
['order_id', 'customer_id', 'order_date', 'ship_date', 'region', 'city', 'payment_method', 'product_category', 'product_id', 'quantity', 'unit_price', 'total_amount', 'discount_code', 'order_status']

Column data types:
order_id             object
customer_id          object
order_date           object
ship_date            object
region               object
city                 object
payment_method       object
product_category     object
product_id           object
quantity             object
unit_price           object
total_amount        float64
discount_code        object
order_status         object
dtype: object

Missing values in each column:
order_id               0
customer_id            0
order_date             0
ship_date            378
region               256
city                 241
payment_method       257
product_category       0
product_id             0
quantity              32
unit_price            35
total_amount           0
discount_code       1045
order_status           0
dtype: int64

Column(s) with the most missing values:
['discount_code']

Number of rows after removing rows with missing values: 3125

Unit price values after replacing 'free' with 0:
0

Number of fully duplicated rows: 0

Number of rows after removing duplicated rows: 1

TypeError: Series.drop_duplicates() got an unexpected keyword argument 'subset'